# pandas的拼接操作

pandas的拼接分为两种：
- 级联：pd.concat, pd.append
- 合并：pd.merge, pd.join

为方便讲解，我们首先定义一个生成DataFrame的函数：

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
def make_df(cols,index):
    #将data创建成字典
    
    data = {c:[str(c)+str(i) for i in index] for c in cols}
    
    #{A:['A1','A2','A3']}
    #{A:['A1','A2','A3'],B:['B1',B2,B3]}
    #{A:['A1','A2','A3'],B:['B1',B2,B3],C:['C1','C2','C3']}
    
    return DataFrame(data,index = index)

In [3]:
make_df('ABC',[1,2,4])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
4  A4  B4  C4

## 0. 回顾numpy的级联

============================================

练习12：

1. 生成2个3*3的矩阵，对其分别进行两个维度上的级联

============================================

In [8]:
np.random.seed(2) #随机数，种子，此时，每次和每次生成的都相同

n = np.random.randint(0,10,size = 9).reshape((3,3))
n

array([[8, 8, 6],
       [2, 8, 7],
       [2, 1, 5]])

In [14]:
data = np.concatenate([n,n],axis = 1)
data

array([[8, 8, 6, 8, 8, 6],
       [2, 8, 7, 2, 8, 7],
       [2, 1, 5, 2, 1, 5]])

In [13]:
print(data.shape,n.shape)

(3, 6) (3, 3)

## 1. 使用pd.concat()级联

pandas使用pd.concat函数，与np.concatenate函数类似，只是多了一些参数：
```
pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
          keys=None, levels=None, names=None, verify_integrity=False,
          copy=True)
```

### 1)  简单级联

和np.concatenate一样，优先增加行数（默认axis=0）

可以通过设置axis来改变级联方向

In [15]:
df1 = make_df('AB',[0,1])
df2 = make_df('AB',[1,2])
display(df1,df2)

    A   B
0  A0  B0
1  A1  B1

    A   B
1  A1  B1
2  A2  B2

In [17]:
df3 = pd.concat([df1,df2])
df3

    A   B
0  A0  B0
1  A1  B1
1  A1  B1
2  A2  B2

In [18]:
df3.loc[1]

    A   B
1  A1  B1
1  A1  B1

In [19]:
pd.concat([df1,df2],axis = 1)

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1   A1   B1
2  NaN  NaN   A2   B2

注意index在级联时可以重复

也可以选择忽略ignore_index，重新索引

In [20]:
pd.concat([df1,df2],axis = 0,ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A1  B1
3  A2  B2

或者使用多层索引 keys  

concat([x,y],keys=['x','y'])

In [22]:
df4 = pd.concat([df1,df2],keys = ['期中','期末'])
df4

       A   B
期中 0  A0  B0
   1  A1  B1
期末 1  A1  B1
   2  A2  B2

In [24]:
df5 = df4.unstack(level = 0)
df5

      A           B
     期中    期末    期中    期末
0    A0  None    B0  None
1    A1    A1    B1    B1
2  None    A2  None    B2

In [25]:
df5.stack(level = 1)

       A   B
0 期中  A0  B0
1 期中  A1  B1
  期末  A1  B1
2 期末  A2  B2

============================================

练习13：

1. 想一想级联的应用场景？

2. 使用昨天的知识，建立一个期中考试张三、李四的成绩表ddd

3. 假设新增考试学科"计算机"，如何实现？

4. 新增王老五同学的成绩，如何实现？

============================================

### 2) 不匹配级联

不匹配指的是级联的维度的索引不一致。例如纵向级联时列索引不一致，横向级联时行索引不一致

In [26]:
df1 = make_df(list('abcd'),[1,2,3])
df2 = make_df(list('acfge'),[1,4,8,9])
display(df1,df2)

    a   b   c   d
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

    a   c   e   f   g
1  a1  c1  e1  f1  g1
4  a4  c4  e4  f4  g4
8  a8  c8  e8  f8  g8
9  a9  c9  e9  f9  g9

有3种连接方式：

- 外连接：补NaN（默认模式）

In [27]:
pd.concat([df1,df2],join='outer')

    a    b   c    d    e    f    g
1  a1   b1  c1   d1  NaN  NaN  NaN
2  a2   b2  c2   d2  NaN  NaN  NaN
3  a3   b3  c3   d3  NaN  NaN  NaN
1  a1  NaN  c1  NaN   e1   f1   g1
4  a4  NaN  c4  NaN   e4   f4   g4
8  a8  NaN  c8  NaN   e8   f8   g8
9  a9  NaN  c9  NaN   e9   f9   g9

- 内连接：只连接匹配的项

In [29]:
#inner,代表两者都有的字段，属性
pd.concat([df1,df2],join='inner',axis = 1)

    a   b   c   d   a   c   e   f   g
1  a1  b1  c1  d1  a1  c1  e1  f1  g1

- 连接指定轴 join_axes

In [38]:
#!!!
pd.concat([df1,df2],join = 'outer',join_axes= df1.index)

AssertionError: length of join_axes must not be equal to 1

============================================

练习14：

    假设【期末】考试ddd2的成绩没有张三的，只有李四、王老五、赵小六的，使用多种方法级联

============================================

### 3) 使用append()函数添加

由于在后面级联的使用非常普遍，因此有一个函数append专门用于在后面添加

============================================

练习15：

    新建一个只有张三李四王老五的期末考试成绩单ddd3，使用append()与期中考试成绩表ddd级联

============================================

## 2. 使用pd.merge()合并

merge与concat的区别在于，merge需要依据某一共同的行或列来进行合并

使用pd.merge()合并时，会自动根据两者相同column名称的那一列，作为key来进行合并。

注意每一列元素的顺序不要求一致

###  1) 一对一合并

### 2) 多对一合并

### 3) 多对多合并

### 4) key的规范化

- 使用on=显式指定哪一列为key,当有多个key相同时使用

- 使用left_on和right_on指定左右两边的列作为key，当左右两边的key都不想等时使用

============================================

练习16：

1. 假设有两份成绩单，除了ddd是张三李四王老五之外，还有ddd4是张三和赵小六的成绩单，如何合并？

2. 如果ddd4中张三的名字被打错了，成为了张十三，怎么办？

3. 自行练习多对一，多对多的情况  

4. 自学left_index,right_index

============================================

### 5) 内合并与外合并

- 内合并：只保留两者都有的key（默认模式）

- 外合并 how='outer'：补NaN

- 左合并、右合并：how='left'，how='right'，

============================================

练习17：

1. 如果只有张三赵小六语数英三个科目的成绩，如何合并？

3. 考虑应用情景，使用多种方式合并ddd与ddd4

============================================

### 6) 列冲突的解决

当列冲突时，即有多个列名称相同时，需要使用on=来指定哪一个列作为key，配合suffixes指定冲突列名

可以使用suffixes=自己指定后缀

============================================

练习18：

    假设有两个同学都叫李四，ddd5、ddd6都是张三和李四的成绩表，如何合并？

============================================

## 作业
## 3. 案例分析：美国各州人口数据分析

首先导入文件，并查看数据样本

In [8]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
pop = pd.read_csv('../../data/state-popsplay(pop.head(),areas.head(),abbrevs.head())ulation.csv')
areas = pd.read_csv('../../data/state-areas.csv')
abbrevs = pd.read_csv('../../data/state-abbrevs.csv')
di

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

合并pop与abbrevs两个DataFrame，分别依据state/region列和abbreviation列来合并。

为了保留所有信息，使用外合并。

In [9]:
merged = pd.merge(pop,abbrevs,how='outer',left_on = 'state/region',right_on = 'abbreviation')
merged2 = pd.merge(pop,abbrevs,left_on = 'state/region',right_on = 'abbreviation')
display(merged.head(),merged2.head())

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

去除abbreviation的那一列（axis=1）

In [12]:
m = merged.drop('abbreviation',axis = 1)
m.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

查看存在缺失数据的列。

使用.isnull().any()，只有某一列存在一个缺失数据，就会显示True。

In [13]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
abbreviation     True
dtype: bool

查看缺失数据

In [15]:
display(merged['population'].isnull().values,type(merged['population'].isnull()))

array([False, False, False, ..., False, False, False], dtype=bool)

pandas.core.series.Series

In [138]:
#根据数据是否缺失情况显示数据，如果缺失为True，那么显示

In [16]:
# display(merged['population'].isnull()) # 查看列population 缺失数据 如果缺失返回null
merged[merged['population'].isnull()] #根据数据是否缺失情况显示数据，如果缺失为True，那么显示

     state/region     ages  year  population state abbreviation
2448           PR  under18  1990         NaN   NaN          NaN
2449           PR    total  1990         NaN   NaN          NaN
2450           PR    total  1991         NaN   NaN          NaN
2451           PR  under18  1991         NaN   NaN          NaN
2452           PR    total  1993         NaN   NaN          NaN
2453           PR  under18  1993         NaN   NaN          NaN
2454           PR  under18  1992         NaN   NaN          NaN
2455           PR    total  1992         NaN   NaN          NaN
2456           PR  under18  1994         NaN   NaN          NaN
2457           PR    total  1994         NaN   NaN          NaN
2458           PR    total  1995         NaN   NaN          NaN
2459           PR  under18  1995         NaN   NaN          NaN
2460           PR  under18  1996         NaN   NaN          NaN
2461           PR    total  1996         NaN   NaN          NaN
2462           PR  under18  1998         NaN   NaN          NaN
2463           PR    total  1998         NaN   NaN          NaN
2464           PR    total  1997         NaN   NaN          NaN
2465           PR  under18  1997         NaN   NaN          NaN
2466           PR    total  1999         NaN   NaN          NaN
2467           PR  under18  1999         NaN   NaN          NaN

找到有哪些state/region使得state的值为NaN，使用unique()查看非重复值

In [17]:
s = merged.loc[merged['state'].isnull(),'state/region']
ss = s.unique()
display(len(merged),len(s),s,ss)

2544

96

2448     PR
2449     PR
2450     PR
2451     PR
2452     PR
2453     PR
2454     PR
2455     PR
2456     PR
2457     PR
2458     PR
2459     PR
2460     PR
2461     PR
2462     PR
2463     PR
2464     PR
2465     PR
2466     PR
2467     PR
2468     PR
2469     PR
2470     PR
2471     PR
2472     PR
2473     PR
2474     PR
2475     PR
2476     PR
2477     PR
       ...
2514    USA
2515    USA
2516    USA
2517    USA
2518    USA
2519    USA
2520    USA
2521    USA
2522    USA
2523    USA
2524    USA
2525    USA
2526    USA
2527    USA
2528    USA
2529    USA
2530    USA
2531    USA
2532    USA
2533    USA
2534    USA
2535    USA
2536    USA
2537    USA
2538    USA
2539    USA
2540    USA
2541    USA
2542    USA
2543    USA
Name: state/region, Length: 96, dtype: object

array(['PR', 'USA'], dtype=object)

为找到的这些state/region的state项补上正确的值，从而去除掉state这一列的所有NaN！

记住这样清除缺失数据NaN的方法！

合并各州面积数据areas，使用左合并。

思考一下为什么使用左合并？

继续寻找存在缺失数据的列

我们会发现area(sq.mi)这一列有缺失数据，为了找出是哪一行，我们需要找出是哪个state没有数据

去除含有缺失数据的行

查看数据是否缺失

找出2010年的全民人口数据,df.query(查询语句)

对查询结果进行处理，以state列作为新的行索引:set_index

计算人口密度。注意是Series/Series，其结果还是一个Series。

排序，并找出人口密度最高的五个州

找出人口密度最低的五个州

要点总结：
- 统一用loc()索引
- 善于使用.isnull().any()找到存在NaN的列
- 善于使用.unique()确定该列中哪些key是我们需要的
- 一般使用外合并、左合并，目的只有一个：宁愿该列是NaN也不要丢弃其他列的信息

## 回顾：Series/DataFrame运算与ndarray运算的区别

- Series与DataFrame没有广播，如果对应index没有值，则记为NaN；或者使用add的fill_value来补缺失值
- ndarray有广播，通过重复已有值来计算